In [1]:
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path
%matplotlib inline

In [10]:
csvpath = "Resources/whale.csv"
whale_df = pd.read_csv(csvpath)
whale_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [12]:
whale_df.shape

(1060, 5)

In [13]:
whale_df.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [16]:
whale_df.dropna(inplace = True)
whale_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
5,2015-03-09,0.000582,0.004225,0.005843,-0.001652

In [17]:
csvpath = "Resources/ALGO.csv"
algo_df = pd.read_csv(csvpath)
algo_df.head()

         Date    Algo 1  Algo 2
0  2014-05-28  0.001745     NaN
1  2014-05-29  0.003978     NaN
2  2014-05-30  0.004464     NaN
3  2014-06-02  0.005692     NaN
4  2014-06-03  0.005292     NaN

In [18]:
algo_df.shape

(1241, 3)

In [23]:
algo_df.isnull().sum()

Date      0
Algo 1    0
Algo 2    0
dtype: int64

In [20]:
algo_df.dropna(inplace = True)
algo_df.head()

          Date    Algo 1    Algo 2
6   2014-06-05  0.004062  0.013285
7   2014-06-06  0.001857  0.008284
8   2014-06-09 -0.005012  0.005668
9   2014-06-10  0.004406 -0.000735
10  2014-06-11  0.004760 -0.003761

In [22]:
algo_df.sample(10)

            Date    Algo 1    Algo 2
1150  2018-12-19 -0.010074 -0.014650
507   2016-06-01 -0.001828  0.006113
1182  2019-02-06 -0.002995 -0.002426
235   2015-05-04  0.003171  0.001876
296   2015-07-30 -0.002263  0.002934
1102  2018-10-10 -0.002851 -0.025833
936   2018-02-13 -0.002735  0.005228
187   2015-02-24  0.005636  0.002793
162   2015-01-16  0.002842  0.012121
642   2016-12-12 -0.005713 -0.006288

In [28]:
csvpath = "Resources/SP500.csv"
SP500_df = pd.read_csv(csvpath, index_col = "Date", infer_datetime_format = True, parse_dates = True)
SP500_df.head()

               Close
Date
2019-04-23  $2933.68
2019-04-22  $2907.97
2019-04-18  $2905.03
2019-04-17  $2900.45
2019-04-16  $2907.06

In [29]:
SP500_df.dtypes

Close    object
dtype: object

In [32]:
SP500_df["Close"] = SP500_df["Close"].str.replace("$", "").astype("float")
SP500_df.sample(5)

              Close
Date
2017-06-23  2438.30
2014-03-24  1857.44
2017-09-27  2507.04
2013-04-08  1563.07
2014-12-10  2026.14

In [33]:
SP500_df.dtypes

Close    float64
dtype: object

In [35]:
#Keeping CLose column, but adding D.returns

SP500_df["Daily Returns"] = SP500_df["Close"].pct_change()
SP500_df.sample(5)

              Close  Daily Returns
Date
2013-03-13  1554.52      -0.005572
2013-02-27  1515.99       0.000865
2018-06-14  2782.49       0.001018
2017-04-13  2328.95      -0.008540
2013-01-08  1457.15      -0.002649